<!-- dflook/terraform-github-actions {"workspace":"repository_dispatch","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"10d724daa50b2e861a62b4a23d1fcfabdf8d71d5602694169ab71a9b295ea8b6","plan_job_ref":"Job Test plan target and replace #345 at https://github.com/dflook/terraform-github-actions/actions/runs/5389587937","plan_hash":"daa406a2c126f7e2bb2ad61369eb848e042d0fd6e9d1b5c1ad42b0e8ffd3a36f","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __repository_dispatch__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "xgrz39IO0Q" -> (known after apply)
  ~ foreach = "HT2ucnlY6z" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #345](https://github.com/dflook/terraform-github-actions/actions/runs/5389587937)